IRP/src/InformationRegisters/T9014S_AccountsExpenseRevenue/T9014S_AccountsExpenseRevenue.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9014S_AccountsExpenseRevenue</name>
 <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
 <resources>
  <name>AccountExpense</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>AccountRevenue</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>AccountOtherPeriodsExpense</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>AccountOtherPeriodsRevenue</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>AccountExpenseReturn</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <resources>
  <name>AccountRevenueReturn</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LedgerTypeVariant</name>
  <type>
   <types>CatalogRef.LedgerTypeVariants</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExpenseRevenue</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Expense</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Revenue</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>OtherPeriodsExpense</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>OtherPeriodsRevenue</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9014S_AccountsExpenseRevenue/RecordSetModule.bsl
Procedure OnWrite(Cancel, Replacing)
	If DataExchange.Load Then
		Return;
	EndIf;
	RefreshReusableValues();
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	For Each Record In ThisObject Do
		If ValueIsFilled(Record.AccountExpense) And Record.AccountExpense.NotUsedForRecords Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(
				StrTemplate(R().AccountingError_01, Record.AccountExpense.Code), 
				"AccountExpense", ThisObject);
		EndIf;
		
		If ValueIsFilled(Record.AccountExpenseReturn) And Record.AccountExpenseReturn.NotUsedForRecords Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(
				StrTemplate(R().AccountingError_01, Record.AccountExpenseReturn.Code), 
				"AccountExpenseReturn", ThisObject);
		EndIf;
		
		If ValueIsFilled(Record.AccountOtherPeriodsExpense) And Record.AccountOtherPeriodsExpense.NotUsedForRecords Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(
				StrTemplate(R().AccountingError_01, Record.AccountOtherPeriodsExpense.Code), 
				"AccountOtherPeriodsExpense", ThisObject);
		EndIf;
		
		If ValueIsFilled(Record.AccountRevenue) And Record.AccountRevenue.NotUsedForRecords Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(
				StrTemplate(R().AccountingError_01, Record.AccountRevenue.Code), 
				"AccountRevenue", ThisObject);
		EndIf;		
		
		If ValueIsFilled(Record.AccountRevenueReturn) And Record.AccountRevenueReturn.NotUsedForRecords Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(
				StrTemplate(R().AccountingError_01, Record.AccountRevenueReturn.Code), 
				"AccountRevenueReturn", ThisObject);
		EndIf;		
		
		If ValueIsFilled(Record.AccountOtherPeriodsRevenue) And Record.AccountOtherPeriodsRevenue.NotUsedForRecords Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(
				StrTemplate(R().AccountingError_01, Record.AccountOtherPeriodsRevenue.Code), 
				"AccountOtherPeriodsRevenue", ThisObject);
		EndIf;		
	EndDo;
EndProcedure
